#include <iostream>

/*
Основные понятия карточной игры Блэк-джек:
Игрок — участник игры против Дилера;
Дилер — раздающий карты из шуза ;
Шуз — специальное устройство в которое после перемешивания вставляется колода карт и из нее идет раздача до следующего шаффла;
шаффл – весь игровой цикл, который длится от перемешивания карт до выхода разделяющей пластиковой карты установленной дилером в шузе;
Рука – карты участника или крупье;
Фишка — заменитель денежной единицы в казино. В каждом игровом заведении свои фишки;
Бокс – место для ставок.

Ход игры:
1. Дилер перемешивает все колоды карт.
2. Игроки делают ставки.
3. Дилер всем игрокам раздает по 2 карты, в том числе и себе и при этом открывает свою одну карту. Есть вариант также, что всем раздают по две карты, а дилер себе оставляет только одну открытую. После чего себе набирает карты.
4. Игроки оценивают свои карты и открытую карту дилера.
5. После оценки ситуации игроки могут взять любое количество карт или остаться на той сумме очков что есть. Главное сумма очков не должно превышать “21” очко.
6. Набор карт игроками проходит строго по очереди.
7. После того как все набрали карты или не взяли в зависимости от ситуации – дилер открывает вторую карту.
8. После открытия второй карты дилер обязан по правилам брать карты если у него 16 и меньше очков и остановиться когда у него будет 17 и больше очков.
9. Игроки свои карты не имеют право трогать – открывает их только дилер.
*/

//Базовый класс
//Ход игры, состояние проигрыша, выиграша, ничьи и имеющиеся деньги у игрока
class Shaffle
{};

//Игрок. Карты имеющиеся на руках у игрока
class Player : public Table
{};

//Дилер. Карты имеющиеся на руках у дилера
class Dealer : public Table
{};

//Стол на котором происходит игра
//На столе отображается весь игровой процесс и состояние игры.
class Table : public Shaffle
{};

//Имеющиеся деньги у игрока на ставки
//Если денег нет - игра завершается проигрышем.
class Credit : public Shaffle
{};

//Ставка игрока. Зависят от имеющиеся денег
class Bet : public Credit
{};

//Базовый класс
//Массив колоды карт и их значения в игре Блэк джек
//Карты находятся на столе
class packOfCards : public Table
{};

//Перемешиватель карт и запоминает порядок карт в Шузе
class cardRandomizer : public packOfCards
{};


int main()
{
	
	return 0;
}